nammenam/playground/flightcomputer/firmware/src/packs/ATSAME53J18A_DFP/component/oscctrl.h
#define OSCCTRL_INTENSET_XOSCRDY0_Pos         _UINT32_(0)                                          /* (OSCCTRL_INTENSET) XOSC 0 Ready Interrupt Enable Position */
#define OSCCTRL_INTENSET_XOSCRDY0_Msk         (_UINT32_(0x1) << OSCCTRL_INTENSET_XOSCRDY0_Pos)     /* (OSCCTRL_INTENSET) XOSC 0 Ready Interrupt Enable Mask */
#define OSCCTRL_INTENSET_XOSCRDY0(value)      (OSCCTRL_INTENSET_XOSCRDY0_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_XOSCRDY0_Pos)) /* Assigment of value for XOSCRDY0 in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_XOSCRDY1_Pos         _UINT32_(1)                                          /* (OSCCTRL_INTENSET) XOSC 1 Ready Interrupt Enable Position */
#define OSCCTRL_INTENSET_XOSCRDY1_Msk         (_UINT32_(0x1) << OSCCTRL_INTENSET_XOSCRDY1_Pos)     /* (OSCCTRL_INTENSET) XOSC 1 Ready Interrupt Enable Mask */
#define OSCCTRL_INTENSET_XOSCRDY1(value)      (OSCCTRL_INTENSET_XOSCRDY1_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_XOSCRDY1_Pos)) /* Assigment of value for XOSCRDY1 in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_XOSCFAIL0_Pos        _UINT32_(2)                                          /* (OSCCTRL_INTENSET) XOSC 0 Clock Failure Detector Interrupt Enable Position */
#define OSCCTRL_INTENSET_XOSCFAIL0_Msk        (_UINT32_(0x1) << OSCCTRL_INTENSET_XOSCFAIL0_Pos)    /* (OSCCTRL_INTENSET) XOSC 0 Clock Failure Detector Interrupt Enable Mask */
#define OSCCTRL_INTENSET_XOSCFAIL0(value)     (OSCCTRL_INTENSET_XOSCFAIL0_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_XOSCFAIL0_Pos)) /* Assigment of value for XOSCFAIL0 in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_XOSCFAIL1_Pos        _UINT32_(3)                                          /* (OSCCTRL_INTENSET) XOSC 1 Clock Failure Detector Interrupt Enable Position */
#define OSCCTRL_INTENSET_XOSCFAIL1_Msk        (_UINT32_(0x1) << OSCCTRL_INTENSET_XOSCFAIL1_Pos)    /* (OSCCTRL_INTENSET) XOSC 1 Clock Failure Detector Interrupt Enable Mask */
#define OSCCTRL_INTENSET_XOSCFAIL1(value)     (OSCCTRL_INTENSET_XOSCFAIL1_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_XOSCFAIL1_Pos)) /* Assigment of value for XOSCFAIL1 in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DFLLRDY_Pos          _UINT32_(8)                                          /* (OSCCTRL_INTENSET) DFLL Ready Interrupt Enable Position */
#define OSCCTRL_INTENSET_DFLLRDY_Msk          (_UINT32_(0x1) << OSCCTRL_INTENSET_DFLLRDY_Pos)      /* (OSCCTRL_INTENSET) DFLL Ready Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DFLLRDY(value)       (OSCCTRL_INTENSET_DFLLRDY_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DFLLRDY_Pos)) /* Assigment of value for DFLLRDY in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DFLLOOB_Pos          _UINT32_(9)                                          /* (OSCCTRL_INTENSET) DFLL Out Of Bounds Interrupt Enable Position */
#define OSCCTRL_INTENSET_DFLLOOB_Msk          (_UINT32_(0x1) << OSCCTRL_INTENSET_DFLLOOB_Pos)      /* (OSCCTRL_INTENSET) DFLL Out Of Bounds Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DFLLOOB(value)       (OSCCTRL_INTENSET_DFLLOOB_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DFLLOOB_Pos)) /* Assigment of value for DFLLOOB in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DFLLLCKF_Pos         _UINT32_(10)                                         /* (OSCCTRL_INTENSET) DFLL Lock Fine Interrupt Enable Position */
#define OSCCTRL_INTENSET_DFLLLCKF_Msk         (_UINT32_(0x1) << OSCCTRL_INTENSET_DFLLLCKF_Pos)     /* (OSCCTRL_INTENSET) DFLL Lock Fine Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DFLLLCKF(value)      (OSCCTRL_INTENSET_DFLLLCKF_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DFLLLCKF_Pos)) /* Assigment of value for DFLLLCKF in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DFLLLCKC_Pos         _UINT32_(11)                                         /* (OSCCTRL_INTENSET) DFLL Lock Coarse Interrupt Enable Position */
#define OSCCTRL_INTENSET_DFLLLCKC_Msk         (_UINT32_(0x1) << OSCCTRL_INTENSET_DFLLLCKC_Pos)     /* (OSCCTRL_INTENSET) DFLL Lock Coarse Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DFLLLCKC(value)      (OSCCTRL_INTENSET_DFLLLCKC_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DFLLLCKC_Pos)) /* Assigment of value for DFLLLCKC in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DFLLRCS_Pos          _UINT32_(12)                                         /* (OSCCTRL_INTENSET) DFLL Reference Clock Stopped Interrupt Enable Position */
#define OSCCTRL_INTENSET_DFLLRCS_Msk          (_UINT32_(0x1) << OSCCTRL_INTENSET_DFLLRCS_Pos)      /* (OSCCTRL_INTENSET) DFLL Reference Clock Stopped Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DFLLRCS(value)       (OSCCTRL_INTENSET_DFLLRCS_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DFLLRCS_Pos)) /* Assigment of value for DFLLRCS in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DPLL0LCKR_Pos        _UINT32_(16)                                         /* (OSCCTRL_INTENSET) DPLL0 Lock Rise Interrupt Enable Position */
#define OSCCTRL_INTENSET_DPLL0LCKR_Msk        (_UINT32_(0x1) << OSCCTRL_INTENSET_DPLL0LCKR_Pos)    /* (OSCCTRL_INTENSET) DPLL0 Lock Rise Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DPLL0LCKR(value)     (OSCCTRL_INTENSET_DPLL0LCKR_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DPLL0LCKR_Pos)) /* Assigment of value for DPLL0LCKR in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DPLL0LCKF_Pos        _UINT32_(17)                                         /* (OSCCTRL_INTENSET) DPLL0 Lock Fall Interrupt Enable Position */
#define OSCCTRL_INTENSET_DPLL0LCKF_Msk        (_UINT32_(0x1) << OSCCTRL_INTENSET_DPLL0LCKF_Pos)    /* (OSCCTRL_INTENSET) DPLL0 Lock Fall Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DPLL0LCKF(value)     (OSCCTRL_INTENSET_DPLL0LCKF_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DPLL0LCKF_Pos)) /* Assigment of value for DPLL0LCKF in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DPLL0LTO_Pos         _UINT32_(18)                                         /* (OSCCTRL_INTENSET) DPLL0 Lock Timeout Interrupt Enable Position */
#define OSCCTRL_INTENSET_DPLL0LTO_Msk         (_UINT32_(0x1) << OSCCTRL_INTENSET_DPLL0LTO_Pos)     /* (OSCCTRL_INTENSET) DPLL0 Lock Timeout Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DPLL0LTO(value)      (OSCCTRL_INTENSET_DPLL0LTO_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DPLL0LTO_Pos)) /* Assigment of value for DPLL0LTO in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DPLL0LDRTO_Pos       _UINT32_(19)                                         /* (OSCCTRL_INTENSET) DPLL0 Loop Divider Ratio Update Complete Interrupt Enable Position */
#define OSCCTRL_INTENSET_DPLL0LDRTO_Msk       (_UINT32_(0x1) << OSCCTRL_INTENSET_DPLL0LDRTO_Pos)   /* (OSCCTRL_INTENSET) DPLL0 Loop Divider Ratio Update Complete Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DPLL0LDRTO(value)    (OSCCTRL_INTENSET_DPLL0LDRTO_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DPLL0LDRTO_Pos)) /* Assigment of value for DPLL0LDRTO in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DPLL1LCKR_Pos        _UINT32_(24)                                         /* (OSCCTRL_INTENSET) DPLL1 Lock Rise Interrupt Enable Position */
#define OSCCTRL_INTENSET_DPLL1LCKR_Msk        (_UINT32_(0x1) << OSCCTRL_INTENSET_DPLL1LCKR_Pos)    /* (OSCCTRL_INTENSET) DPLL1 Lock Rise Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DPLL1LCKR(value)     (OSCCTRL_INTENSET_DPLL1LCKR_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DPLL1LCKR_Pos)) /* Assigment of value for DPLL1LCKR in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DPLL1LCKF_Pos        _UINT32_(25)                                         /* (OSCCTRL_INTENSET) DPLL1 Lock Fall Interrupt Enable Position */
#define OSCCTRL_INTENSET_DPLL1LCKF_Msk        (_UINT32_(0x1) << OSCCTRL_INTENSET_DPLL1LCKF_Pos)    /* (OSCCTRL_INTENSET) DPLL1 Lock Fall Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DPLL1LCKF(value)     (OSCCTRL_INTENSET_DPLL1LCKF_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DPLL1LCKF_Pos)) /* Assigment of value for DPLL1LCKF in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DPLL1LTO_Pos         _UINT32_(26)                                         /* (OSCCTRL_INTENSET) DPLL1 Lock Timeout Interrupt Enable Position */
#define OSCCTRL_INTENSET_DPLL1LTO_Msk         (_UINT32_(0x1) << OSCCTRL_INTENSET_DPLL1LTO_Pos)     /* (OSCCTRL_INTENSET) DPLL1 Lock Timeout Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DPLL1LTO(value)      (OSCCTRL_INTENSET_DPLL1LTO_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DPLL1LTO_Pos)) /* Assigment of value for DPLL1LTO in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DPLL1LDRTO_Pos       _UINT32_(27)                                         /* (OSCCTRL_INTENSET) DPLL1 Loop Divider Ratio Update Complete Interrupt Enable Position */
#define OSCCTRL_INTENSET_DPLL1LDRTO_Msk       (_UINT32_(0x1) << OSCCTRL_INTENSET_DPLL1LDRTO_Pos)   /* (OSCCTRL_INTENSET) DPLL1 Loop Divider Ratio Update Complete Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DPLL1LDRTO(value)    (OSCCTRL_INTENSET_DPLL1LDRTO_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DPLL1LDRTO_Pos)) /* Assigment of value for DPLL1LDRTO in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_Msk                  _UINT32_(0x0F0F1F0F)                                 /* (OSCCTRL_INTENSET) Register Mask  */

#define OSCCTRL_INTENSET_XOSCRDY_Pos          _UINT32_(0)                                          /* (OSCCTRL_INTENSET Position) XOSC x Ready Interrupt Enable */
#define OSCCTRL_INTENSET_XOSCRDY_Msk          (_UINT32_(0x3) << OSCCTRL_INTENSET_XOSCRDY_Pos)      /* (OSCCTRL_INTENSET Mask) XOSCRDY */
#define OSCCTRL_INTENSET_XOSCRDY(value)       (OSCCTRL_INTENSET_XOSCRDY_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_XOSCRDY_Pos)) 
#define OSCCTRL_INTENSET_XOSCFAIL_Pos         _UINT32_(2)                                          /* (OSCCTRL_INTENSET Position) XOSC x Clock Failure Detector Interrupt Enable */
#define OSCCTRL_INTENSET_XOSCFAIL_Msk         (_UINT32_(0x3) << OSCCTRL_INTENSET_XOSCFAIL_Pos)     /* (OSCCTRL_INTENSET Mask) XOSCFAIL */
#define OSCCTRL_INTENSET_XOSCFAIL(value)      (OSCCTRL_INTENSET_XOSCFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_XOSCFAIL_Pos)) 

/* -------- OSCCTRL_INTFLAG : (OSCCTRL Offset: 0x0C) (R/W 32) Interrupt Flag Status and Clear -------- */
#define OSCCTRL_INTFLAG_RESETVALUE            _UINT32_(0x00)                                       /*  (OSCCTRL_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define OSCCTRL_INTFLAG_XOSCRDY0_Pos          _UINT32_(0)                                          /* (OSCCTRL_INTFLAG) XOSC 0 Ready Position */
#define OSCCTRL_INTFLAG_XOSCRDY0_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_XOSCRDY0_Pos)      /* (OSCCTRL_INTFLAG) XOSC 0 Ready Mask */
#define OSCCTRL_INTFLAG_XOSCRDY0(value)       (OSCCTRL_INTFLAG_XOSCRDY0_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_XOSCRDY0_Pos)) /* Assigment of value for XOSCRDY0 in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_XOSCRDY1_Pos          _UINT32_(1)                                          /* (OSCCTRL_INTFLAG) XOSC 1 Ready Position */
#define OSCCTRL_INTFLAG_XOSCRDY1_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_XOSCRDY1_Pos)      /* (OSCCTRL_INTFLAG) XOSC 1 Ready Mask */
#define OSCCTRL_INTFLAG_XOSCRDY1(value)       (OSCCTRL_INTFLAG_XOSCRDY1_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_XOSCRDY1_Pos)) /* Assigment of value for XOSCRDY1 in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_XOSCFAIL0_Pos         _UINT32_(2)                                          /* (OSCCTRL_INTFLAG) XOSC 0 Clock Failure Detector Position */
#define OSCCTRL_INTFLAG_XOSCFAIL0_Msk         (_UINT32_(0x1) << OSCCTRL_INTFLAG_XOSCFAIL0_Pos)     /* (OSCCTRL_INTFLAG) XOSC 0 Clock Failure Detector Mask */
#define OSCCTRL_INTFLAG_XOSCFAIL0(value)      (OSCCTRL_INTFLAG_XOSCFAIL0_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_XOSCFAIL0_Pos)) /* Assigment of value for XOSCFAIL0 in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_XOSCFAIL1_Pos         _UINT32_(3)                                          /* (OSCCTRL_INTFLAG) XOSC 1 Clock Failure Detector Position */
#define OSCCTRL_INTFLAG_XOSCFAIL1_Msk         (_UINT32_(0x1) << OSCCTRL_INTFLAG_XOSCFAIL1_Pos)     /* (OSCCTRL_INTFLAG) XOSC 1 Clock Failure Detector Mask */
#define OSCCTRL_INTFLAG_XOSCFAIL1(value)      (OSCCTRL_INTFLAG_XOSCFAIL1_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_XOSCFAIL1_Pos)) /* Assigment of value for XOSCFAIL1 in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLRDY_Pos           _UINT32_(8)                                          /* (OSCCTRL_INTFLAG) DFLL Ready Position */
#define OSCCTRL_INTFLAG_DFLLRDY_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLRDY_Pos)       /* (OSCCTRL_INTFLAG) DFLL Ready Mask */
#define OSCCTRL_INTFLAG_DFLLRDY(value)        (OSCCTRL_INTFLAG_DFLLRDY_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLRDY_Pos)) /* Assigment of value for DFLLRDY in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLOOB_Pos           _UINT32_(9)                                          /* (OSCCTRL_INTFLAG) DFLL Out Of Bounds Position */
#define OSCCTRL_INTFLAG_DFLLOOB_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLOOB_Pos)       /* (OSCCTRL_INTFLAG) DFLL Out Of Bounds Mask */
#define OSCCTRL_INTFLAG_DFLLOOB(value)        (OSCCTRL_INTFLAG_DFLLOOB_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLOOB_Pos)) /* Assigment of value for DFLLOOB in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLLCKF_Pos          _UINT32_(10)                                         /* (OSCCTRL_INTFLAG) DFLL Lock Fine Position */
#define OSCCTRL_INTFLAG_DFLLLCKF_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLLCKF_Pos)      /* (OSCCTRL_INTFLAG) DFLL Lock Fine Mask */
#define OSCCTRL_INTFLAG_DFLLLCKF(value)       (OSCCTRL_INTFLAG_DFLLLCKF_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLLCKF_Pos)) /* Assigment of value for DFLLLCKF in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLLCKC_Pos          _UINT32_(11)                                         /* (OSCCTRL_INTFLAG) DFLL Lock Coarse Position */
#define OSCCTRL_INTFLAG_DFLLLCKC_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLLCKC_Pos)      /* (OSCCTRL_INTFLAG) DFLL Lock Coarse Mask */
#define OSCCTRL_INTFLAG_DFLLLCKC(value)       (OSCCTRL_INTFLAG_DFLLLCKC_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLLCKC_Pos)) /* Assigment of value for DFLLLCKC in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLRCS_Pos           _UINT32_(12)                                         /* (OSCCTRL_INTFLAG) DFLL Reference Clock Stopped Position */
#define OSCCTRL_INTFLAG_DFLLRCS_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLRCS_Pos)       /* (OSCCTRL_INTFLAG) DFLL Reference Clock Stopped Mask */
#define OSCCTRL_INTFLAG_DFLLRCS(value)        (OSCCTRL_INTFLAG_DFLLRCS_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLRCS_Pos)) /* Assigment of value for DFLLRCS in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLL0LCKR_Pos         _UINT32_(16)                                         /* (OSCCTRL_INTFLAG) DPLL0 Lock Rise Position */
#define OSCCTRL_INTFLAG_DPLL0LCKR_Msk         (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLL0LCKR_Pos)     /* (OSCCTRL_INTFLAG) DPLL0 Lock Rise Mask */
#define OSCCTRL_INTFLAG_DPLL0LCKR(value)      (OSCCTRL_INTFLAG_DPLL0LCKR_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLL0LCKR_Pos)) /* Assigment of value for DPLL0LCKR in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLL0LCKF_Pos         _UINT32_(17)                                         /* (OSCCTRL_INTFLAG) DPLL0 Lock Fall Position */
#define OSCCTRL_INTFLAG_DPLL0LCKF_Msk         (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLL0LCKF_Pos)     /* (OSCCTRL_INTFLAG) DPLL0 Lock Fall Mask */
#define OSCCTRL_INTFLAG_DPLL0LCKF(value)      (OSCCTRL_INTFLAG_DPLL0LCKF_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLL0LCKF_Pos)) /* Assigment of value for DPLL0LCKF in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLL0LTO_Pos          _UINT32_(18)                                         /* (OSCCTRL_INTFLAG) DPLL0 Lock Timeout Position */
#define OSCCTRL_INTFLAG_DPLL0LTO_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLL0LTO_Pos)      /* (OSCCTRL_INTFLAG) DPLL0 Lock Timeout Mask */
#define OSCCTRL_INTFLAG_DPLL0LTO(value)       (OSCCTRL_INTFLAG_DPLL0LTO_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLL0LTO_Pos)) /* Assigment of value for DPLL0LTO in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLL0LDRTO_Pos        _UINT32_(19)                                         /* (OSCCTRL_INTFLAG) DPLL0 Loop Divider Ratio Update Complete Position */
#define OSCCTRL_INTFLAG_DPLL0LDRTO_Msk        (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLL0LDRTO_Pos)    /* (OSCCTRL_INTFLAG) DPLL0 Loop Divider Ratio Update Complete Mask */
#define OSCCTRL_INTFLAG_DPLL0LDRTO(value)     (OSCCTRL_INTFLAG_DPLL0LDRTO_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLL0LDRTO_Pos)) /* Assigment of value for DPLL0LDRTO in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLL1LCKR_Pos         _UINT32_(24)                                         /* (OSCCTRL_INTFLAG) DPLL1 Lock Rise Position */
#define OSCCTRL_INTFLAG_DPLL1LCKR_Msk         (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLL1LCKR_Pos)     /* (OSCCTRL_INTFLAG) DPLL1 Lock Rise Mask */
#define OSCCTRL_INTFLAG_DPLL1LCKR(value)      (OSCCTRL_INTFLAG_DPLL1LCKR_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLL1LCKR_Pos)) /* Assigment of value for DPLL1LCKR in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLL1LCKF_Pos         _UINT32_(25)                                         /* (OSCCTRL_INTFLAG) DPLL1 Lock Fall Position */
#define OSCCTRL_INTFLAG_DPLL1LCKF_Msk         (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLL1LCKF_Pos)     /* (OSCCTRL_INTFLAG) DPLL1 Lock Fall Mask */
#define OSCCTRL_INTFLAG_DPLL1LCKF(value)      (OSCCTRL_INTFLAG_DPLL1LCKF_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLL1LCKF_Pos)) /* Assigment of value for DPLL1LCKF in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLL1LTO_Pos          _UINT32_(26)                                         /* (OSCCTRL_INTFLAG) DPLL1 Lock Timeout Position */
#define OSCCTRL_INTFLAG_DPLL1LTO_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLL1LTO_Pos)      /* (OSCCTRL_INTFLAG) DPLL1 Lock Timeout Mask */
#define OSCCTRL_INTFLAG_DPLL1LTO(value)       (OSCCTRL_INTFLAG_DPLL1LTO_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLL1LTO_Pos)) /* Assigment of value for DPLL1LTO in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLL1LDRTO_Pos        _UINT32_(27)                                         /* (OSCCTRL_INTFLAG) DPLL1 Loop Divider Ratio Update Complete Position */
#define OSCCTRL_INTFLAG_DPLL1LDRTO_Msk        (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLL1LDRTO_Pos)    /* (OSCCTRL_INTFLAG) DPLL1 Loop Divider Ratio Update Complete Mask */
#define OSCCTRL_INTFLAG_DPLL1LDRTO(value)     (OSCCTRL_INTFLAG_DPLL1LDRTO_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLL1LDRTO_Pos)) /* Assigment of value for DPLL1LDRTO in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_Msk                   _UINT32_(0x0F0F1F0F)                                 /* (OSCCTRL_INTFLAG) Register Mask  */

#define OSCCTRL_INTFLAG_XOSCRDY_Pos           _UINT32_(0)                                          /* (OSCCTRL_INTFLAG Position) XOSC x Ready */
#define OSCCTRL_INTFLAG_XOSCRDY_Msk           (_UINT32_(0x3) << OSCCTRL_INTFLAG_XOSCRDY_Pos)       /* (OSCCTRL_INTFLAG Mask) XOSCRDY */
#define OSCCTRL_INTFLAG_XOSCRDY(value)        (OSCCTRL_INTFLAG_XOSCRDY_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_XOSCRDY_Pos)) 
#define OSCCTRL_INTFLAG_XOSCFAIL_Pos          _UINT32_(2)                                          /* (OSCCTRL_INTFLAG Position) XOSC x Clock Failure Detector */
#define OSCCTRL_INTFLAG_XOSCFAIL_Msk          (_UINT32_(0x3) << OSCCTRL_INTFLAG_XOSCFAIL_Pos)      /* (OSCCTRL_INTFLAG Mask) XOSCFAIL */
#define OSCCTRL_INTFLAG_XOSCFAIL(value)       (OSCCTRL_INTFLAG_XOSCFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_XOSCFAIL_Pos)) 

/* -------- OSCCTRL_STATUS : (OSCCTRL Offset: 0x10) ( R/ 32) Status -------- */
#define OSCCTRL_STATUS_RESETVALUE             _UINT32_(0x00)                                       /*  (OSCCTRL_STATUS) Status  Reset Value */

